
root@debian:/home/todd/gns3# python3 telnet_py3.py 
Enter host IPs u want to connect to seperate using a space : 192.168.10.1 192.168.10.2 192.168.10.3
Enter cmd seperate with a ',' : show clock, show ip ospf nei, show ip int brief
Username: cisco
Password: 
Connecting to host: 192.168.10.1

R1#term length 0
R1#show clock
*23:57:35.558 UTC Fri Jul 28 2017
R1# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.2      1   FULL/BDR        00:00:30    192.168.10.2    FastEthernet0/0
192.168.10.3      1   FULL/DR         00:00:29    192.168.10.3    FastEthernet0/0
R1# show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.1    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R1#exit

Connecting to host: 192.168.10.2

R2#term length 0
R2#show clock
*23:51:17.574 UTC Fri Jul 28 2017
R2# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.1      1   FULL/DROTHER    00:00:38    192.168.10.1    FastEthernet0/0
192.168.10.3      1   FULL/DR         00:00:39    192.168.10.3    FastEthernet0/0
R2# show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.2    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R2#exit

Connecting to host: 192.168.10.3

R3#term length 0
R3#show clock
*00:13:32.182 UTC Sat Jul 29 2017
R3# show ip ospf nei

Neighbor ID     Pri   State           Dead Time   Address         Interface
192.168.10.1      1   FULL/DROTHER    00:00:38    192.168.10.1    FastEthernet0/0
192.168.10.2      1   FULL/BDR        00:00:38    192.168.10.2    FastEthernet0/0
R3# show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.3    YES manual up                    up      
FastEthernet1/0        unassigned      YES unset  up                    up      
FastEthernet1/1        unassigned      YES unset  administratively down down    
Serial2/0              unassigned      YES unset  administratively down down    
Serial2/1              unassigned      YES unset  administratively down down    
Serial2/2              unassigned      YES unset  administratively down down    
Serial2/3              unassigned      YES unset  administratively down down    
R3#exit

root@debian:/home/todd/gns3#


root@debian:/home/todd/gns3# python3 telnet_py3.py 
Enter host IPs u want to connect to seperate using a space : 192.168.10.1 192.168.10.2 192.168.10.3
Enter cmd seperate with a ',' : config t, int loop101, description test123, exit, exit, sh run int loop101
Username: cisco
Password: 
Connecting to host: 192.168.10.1

R1#term length 0
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)# int loop101
R1(config-if)# description test123
R1(config-if)# exit
R1(config)# exit
R1# sh run int loop101
Building configuration...

Current configuration : 65 bytes
!
interface Loopback101
 description test123
 no ip address
end

R1#exit

Connecting to host: 192.168.10.2

R2#term length 0
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)# int loop101
R2(config-if)# description test123
R2(config-if)# exit
R2(config)# exit
R2# sh run int loop101
Building configuration...

Current configuration : 65 bytes
!
interface Loopback101
 description test123
 no ip address
end

R2#exit

Connecting to host: 192.168.10.3

R3#term length 0
R3#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)# int loop101
R3(config-if)# description test123
R3(config-if)# exit
R3(config)# exit
R3# sh run int loop101
Building configuration...

Current configuration : 65 bytes
!
interface Loopback101
 description test123
 no ip address
end

R3#exit
